In [1]:
import pandas as pd
import numpy as np

In [2]:
# Series 객체를 생성할 때 pd.Series()
series = pd.Series(['하나,', '둘', '셋'],
                   index = range(1, 4))

In [3]:
series

1    하나,
2      둘
3      셋
dtype: object

In [4]:
s = pd.Series([9_904_312,3_448_737,2_890_451, 2_466_052],
              index=['서울', '부산', '인천', '대구'])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [5]:
s1 = pd.Series([10, 20, 30, 40, 50, 60, 70, 80, 90],
               index=[0, 1, 2, 3, 4, 5, 6, 7, 8])
s1

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [6]:
s2 = pd.Series([_ for _ in range(10, 91, 10)],
                index=[i for i in range(0, 9)])
s2

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [7]:
test = pd.Series(list(range(10, 100, 10)))
test

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [8]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [9]:
s.values

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

In [10]:
sum(test.values > 50)

4

In [11]:
print(test.values)
print(test.values > 50)

[10 20 30 40 50 60 70 80 90]
[False False False False False  True  True  True  True]

In [12]:
s.name = "인구"
s.index.name = "도시"

In [13]:
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [14]:
d = {'a' : 1, 'b' : 2, 'c' : 3}
ser = pd.Series(data=d, index=['c', 'a', 'b'])
ser

c    3
a    1
b    2
dtype: int64

In [15]:
ser = pd.Series(data = d, index = ['x', 'y', 'z'])
ser

x   NaN
y   NaN
z   NaN
dtype: float64

In [16]:
ser1= pd.Series([8, 95, 100, 67],
                index = ["철수", "영희", "길동", "몽룡"])
ser1.index.name= "이름"
ser1.name = "사회점수"
ser1

이름
철수      8
영희     95
길동    100
몽룡     67
Name: 사회점수, dtype: int64

In [17]:
test = dict(zip(range(10), list("영일이삼사오육칠팔구")))

In [18]:
#dict
for k, v, in test.items():
    print(f'{k}, {v}')

0, 영
1, 일
2, 이
3, 삼
4, 사
5, 오
6, 육
7, 칠
8, 팔
9, 구

In [19]:
"영" in test.values()

True

In [20]:
'서울' in s

True

In [21]:
for k,v in s.items():
    print(f'{k}, {v}')

서울, 9904312
부산, 3448737
인천, 2890451
대구, 2466052

In [22]:
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [23]:
for c, p in s.items():
    if p > 3000000:
        print(f"{c}의 인구는 300만이 넘습니다.")

서울의 인구는 300만이 넘습니다.
부산의 인구는 300만이 넘습니다.

In [24]:
s[[2]]

도시
인천    2890451
Name: 인구, dtype: int64

In [25]:
s[["인천"]]

도시
인천    2890451
Name: 인구, dtype: int64

In [26]:
s2 = pd.Series({"서울":9631482, "부산":3393191, "인천":2632035, "대전":1490158})
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [27]:
ds = s - s2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [28]:
ds.isnull()

대구     True
대전     True
부산    False
서울    False
인천    False
dtype: bool

In [29]:
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [30]:
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [31]:
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [32]:
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [33]:
i = s-s2
n = i[i.notnull()]
i[[i.argmax()]]

서울    272830.0
dtype: float64

In [34]:
i = s-s2
n = i[i.notnull()]
i[[i.argmax()]]

서울    272830.0
dtype: float64

In [35]:
rs = (s - s2) / s2 * 100
rs = rs[rs.notnull()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [36]:
rs["서울", "인천"] = 2.83, 9.82
rs

부산    1.636984
서울    2.830000
인천    9.820000
dtype: float64

In [37]:
rs["서울":"인천"] = (2.83, 9.82)
rs

부산    1.636984
서울    2.830000
인천    9.820000
dtype: float64

In [38]:
fin1 = {"카카오":60010, "삼성전자":61000, "LG전자":90000}
fin2_value = [60200, 61200, 200100]
fin2_index = ["카카오", "삼성전자", "네이버"]

ser_finance1 = pd.Series(fin1)
ser_finance1

카카오     60010
삼성전자    61000
LG전자    90000
dtype: int64

In [39]:
ser_finance2 = pd.Series(fin2_value, fin2_index)
ser_finance2

카카오      60200
삼성전자     61200
네이버     200100
dtype: int64

In [40]:
ser_finance1 - ser_finance2

LG전자      NaN
네이버       NaN
삼성전자   -200.0
카카오    -190.0
dtype: float64

In [41]:
ser_finance1 + ser_finance2

LG전자         NaN
네이버          NaN
삼성전자    122200.0
카카오     120210.0
dtype: float64

In [42]:
ser_finance1 * ser_finance2

LG전자             NaN
네이버              NaN
삼성전자    3.733200e+09
카카오     3.612602e+09
dtype: float64

In [43]:
ser_finance1 / ser_finance2

LG전자         NaN
네이버          NaN
삼성전자    0.996732
카카오     0.996844
dtype: float64

In [44]:
result = ser_finance1 - ser_finance2
result[result.notnull()]

삼성전자   -200.0
카카오    -190.0
dtype: float64

In [45]:
data = {
    "2015" : [9904312, 3448737, 2890451, 2466052],
    "2010" : [9631482, 3393191, 2632035, 2431774],
    "2005" : [9762546, 3512547, 2517680, 2456016],
    "2000" : [9853972, 3655437, 2466338, 2473990],
    "지역" : ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율" :[0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index = index, columns = columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [46]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [47]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [48]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [49]:
df.dtypes

지역                object
2015               int64
2010               int64
2005               int64
2000               int64
2010-2015 증가율    float64
dtype: object

In [50]:
df.index.name = "도시"
df.columns.name = "특성"
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [51]:
df["2010-2015 증가율"] = df["2010-2015 증가율"] * 100
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [52]:
df["2005-2010 증가율"] = ((df["2010"] - df["2005"]) / df["2005"] * 100).round(2)
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54
대구  경상권  2466052  2431774  2456016  2473990           1.41          -0.99

In [53]:
del df["2010-2015 증가율"]
df

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

In [54]:
df[["2010"]]
type(df[["2010"]])

pandas.core.frame.DataFrame

In [55]:
data = {
    "운항 도착": [1_762, 1753, 1448, 1527, 1474, 1550, 1781],
    "운항 출발": [1733, 1689, 1546, 1503, 1482, 1541, 1797],
    "여객 도착": [302283, 291424, 228763, 229579, 233961, 246433, 307484],
    "여객 출발": [321504, 294868, 267957, 259911, 270649, 273268, 317069],
    "요일": ["월요일", "화요일", "수요일", "목요일", "금요일", "토요일", "일요일"],
}
columns = ["운항 도착", "운항 출발", "여객 도착", "여객 출발"]
index = ["월요일", "화요일", "수요일", "목요일", "금요일", "토요일", "일요일"]
df = pd.DataFrame(data, index=index, columns=columns)

df

     운항 도착  운항 출발   여객 도착   여객 출발
월요일   1762   1733  302283  321504
화요일   1753   1689  291424  294868
수요일   1448   1546  228763  267957
목요일   1527   1503  229579  259911
금요일   1474   1482  233961  270649
토요일   1550   1541  246433  273268
일요일   1781   1797  307484  317069

In [56]:
data = {
    "도착": [7771, 8354, 9861, 10499, 10244, 9739, 9000],
    "출발": [7087, 8921, 10266, 10379, 10023, 9432, 9451],
    "도착": [10963, 11285, 12355, 13285, 12619, 12755, 12074],
    "출발": [10464, 11330, 13464, 12973, 12546, 12873, 12267],
    "요일": ["월요일", "화요일", "수요일", "목요일", "금요일", "토요일", "일요일"],}
columns = ["도착", "출발", "도착", "출발"]
index = ["월요일", "화요일", "수요일", "목요일", "금요일", "토요일", "일요일"]
df = pd.DataFrame(data, index=index, columns=columns)
df.index.name = "요일"
df.columns.name = "운항(편)"
df

운항(편)     도착     출발     도착     출발
요일
월요일    10963  10464  10963  10464
화요일    11285  11330  11285  11330
수요일    12355  13464  12355  13464
목요일    13285  12973  13285  12973
금요일    12619  12546  12619  12546
토요일    12755  12873  12755  12873
일요일    12074  12267  12074  12267

In [57]:
#"전년대비 증감률": [-12.70, -12.50, 30.30, 31.10]

In [58]:
data = {
    "도착": [7771, 8354, 9861, 10499, 10244, 9739, 9000],
    "출발": [7087, 8921, 10266, 10379, 10023, 9432, 9451],
    "도착": [10963, 11285, 12355, 13285, 12619, 12755, 12074],
    "출발": [10464, 11330, 13464, 12973, 12546, 12873, 12267],
    "요일": ["월요일", "화요일", "수요일", "목요일", "금요일", "토요일", "일요일"],}
columns = ["도착", "출발", "도착", "출발"]
index = ["월요일", "화요일", "수요일", "목요일", "금요일", "토요일", "일요일"]
df = pd.DataFrame(data, index=index, columns=columns)
df.index.name = "요일"
df.columns.name = "운항(편)"
df

운항(편)     도착     출발     도착     출발
요일
월요일    10963  10464  10963  10464
화요일    11285  11330  11285  11330
수요일    12355  13464  12355  13464
목요일    13285  12973  13285  12973
금요일    12619  12546  12619  12546
토요일    12755  12873  12755  12873
일요일    12074  12267  12074  12267

In [59]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [60]:
df["수학"]

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [61]:
df[["국어", "영어"]]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [68]:
df["과목 평균 점수"] = df.mean(axis=1)
df

    국어  영어  수학   과목 평균 점수
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  40  70  46.666667

In [ ]:
# df["평균"] = round((df["국어"] + df["영어"] + df["수학"] / 3, 2)

In [63]:
df[:1]
# df["춘향" : "춘향"]

    국어  영어  수학
춘향  80  90  90

In [65]:
df.T["향단"]

국어    70
영어    60
수학    80
Name: 향단, dtype: int64

In [79]:
np.random.seed(0)
values = np.random.randn(6, 4)
index = pd.date_range("20130226", periods=6)
columns = ["A", "B", "C", "D"]
df2 = pd.DataFrame(values, index=index, columns=columns)
df2

                   A         B         C         D
2013-02-26  1.764052  0.400157  0.978738  2.240893
2013-02-27  1.867558 -0.977278  0.950088 -0.151357
2013-02-28 -0.103219  0.410599  0.144044  1.454274
2013-03-01  0.761038  0.121675  0.443863  0.333674
2013-03-02  1.494079 -0.205158  0.313068 -0.854096
2013-03-03 -2.552990  0.653619  0.864436 -0.742165